remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_rom.h
/**
 * \file
 *
 * \brief Component description for ARM_ROM
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_ARM_ROM_COMPONENT_
#define _SAMB11_ARM_ROM_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ARM_ROM */
/* ========================================================================== */
/** \addtogroup SAMB11_ARM_ROM ARM ROM 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define ARM_ROM_AR1234
#define REV_ARM_ROM                      0x100

/* -------- ARM_ROM_ROM_SCS : (ARM_ROM Offset: 0x00) (R/ 32) Points to the SCS at 0xE000E000 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ROM_SCS:32;                /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_ROM_ROM_SCS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_SCS_OFFSET              0x00                                          /**<  (ARM_ROM_ROM_SCS) Points to the SCS at 0xE000E000  Offset */
#define ARM_ROM_ROM_SCS_RESETVALUE          0xFFF0F003u                                   /**<  (ARM_ROM_ROM_SCS) Points to the SCS at 0xE000E000  Reset Value */

#define ARM_ROM_ROM_SCS_ROM_SCS_Pos         0                                              /**< (ARM_ROM_ROM_SCS)  Position */
#define ARM_ROM_ROM_SCS_ROM_SCS_Msk         (0xFFFFFFFFu << ARM_ROM_ROM_SCS_ROM_SCS_Pos)   /**< (ARM_ROM_ROM_SCS)  Mask */
#define ARM_ROM_ROM_SCS_ROM_SCS(value)      (ARM_ROM_ROM_SCS_ROM_SCS_Msk & ((value) << ARM_ROM_ROM_SCS_ROM_SCS_Pos))
#define ARM_ROM_ROM_SCS_MASK                0xFFFFFFFFu                                    /**< \deprecated (ARM_ROM_ROM_SCS) Register MASK  (Use ARM_ROM_ROM_SCS_Msk instead)  */
#define ARM_ROM_ROM_SCS_Msk                 0xFFFFFFFFu                                    /**< (ARM_ROM_ROM_SCS) Register Mask  */

/* -------- ARM_ROM_ROM_DWT : (ARM_ROM Offset: 0x10) (R/ 32) Points to the DWT at 0xE0001000 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ROM_DWT:32;                /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_ROM_ROM_DWT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_DWT_OFFSET              0x10                                          /**<  (ARM_ROM_ROM_DWT) Points to the DWT at 0xE0001000  Offset */
#define ARM_ROM_ROM_DWT_RESETVALUE          0xFFF02003u                                   /**<  (ARM_ROM_ROM_DWT) Points to the DWT at 0xE0001000  Reset Value */

#define ARM_ROM_ROM_DWT_ROM_DWT_Pos         0                                              /**< (ARM_ROM_ROM_DWT)  Position */
#define ARM_ROM_ROM_DWT_ROM_DWT_Msk         (0xFFFFFFFFu << ARM_ROM_ROM_DWT_ROM_DWT_Pos)   /**< (ARM_ROM_ROM_DWT)  Mask */
#define ARM_ROM_ROM_DWT_ROM_DWT(value)      (ARM_ROM_ROM_DWT_ROM_DWT_Msk & ((value) << ARM_ROM_ROM_DWT_ROM_DWT_Pos))
#define ARM_ROM_ROM_DWT_MASK                0xFFFFFFFFu                                    /**< \deprecated (ARM_ROM_ROM_DWT) Register MASK  (Use ARM_ROM_ROM_DWT_Msk instead)  */
#define ARM_ROM_ROM_DWT_Msk                 0xFFFFFFFFu                                    /**< (ARM_ROM_ROM_DWT) Register Mask  */

/* -------- ARM_ROM_ROM_BPU : (ARM_ROM Offset: 0x20) (R/ 32) Points to the BPU at 0xE0002000 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ROM_BPU:32;                /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_ROM_ROM_BPU_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_BPU_OFFSET              0x20                                          /**<  (ARM_ROM_ROM_BPU) Points to the BPU at 0xE0002000  Offset */
#define ARM_ROM_ROM_BPU_RESETVALUE          0xFFF03003u                                   /**<  (ARM_ROM_ROM_BPU) Points to the BPU at 0xE0002000  Reset Value */

#define ARM_ROM_ROM_BPU_ROM_BPU_Pos         0                                              /**< (ARM_ROM_ROM_BPU)  Position */
#define ARM_ROM_ROM_BPU_ROM_BPU_Msk         (0xFFFFFFFFu << ARM_ROM_ROM_BPU_ROM_BPU_Pos)   /**< (ARM_ROM_ROM_BPU)  Mask */
#define ARM_ROM_ROM_BPU_ROM_BPU(value)      (ARM_ROM_ROM_BPU_ROM_BPU_Msk & ((value) << ARM_ROM_ROM_BPU_ROM_BPU_Pos))
#define ARM_ROM_ROM_BPU_MASK                0xFFFFFFFFu                                    /**< \deprecated (ARM_ROM_ROM_BPU) Register MASK  (Use ARM_ROM_ROM_BPU_Msk instead)  */
#define ARM_ROM_ROM_BPU_Msk                 0xFFFFFFFFu                                    /**< (ARM_ROM_ROM_BPU) Register Mask  */

/* -------- ARM_ROM_ROM_EOT : (ARM_ROM Offset: 0x30) (R/ 32) End of Table Marker -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ROM_EOT:32;                /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_ROM_ROM_EOT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

