remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_rom.h
#define ARM_ROM_ROM_EOT_OFFSET              0x30                                          /**<  (ARM_ROM_ROM_EOT) End of Table Marker  Offset */
#define ARM_ROM_ROM_EOT_RESETVALUE          0x00u                                         /**<  (ARM_ROM_ROM_EOT) End of Table Marker  Reset Value */

#define ARM_ROM_ROM_EOT_ROM_EOT_Pos         0                                              /**< (ARM_ROM_ROM_EOT)  Position */
#define ARM_ROM_ROM_EOT_ROM_EOT_Msk         (0xFFFFFFFFu << ARM_ROM_ROM_EOT_ROM_EOT_Pos)   /**< (ARM_ROM_ROM_EOT)  Mask */
#define ARM_ROM_ROM_EOT_ROM_EOT(value)      (ARM_ROM_ROM_EOT_ROM_EOT_Msk & ((value) << ARM_ROM_ROM_EOT_ROM_EOT_Pos))
#define ARM_ROM_ROM_EOT_MASK                0xFFFFFFFFu                                    /**< \deprecated (ARM_ROM_ROM_EOT) Register MASK  (Use ARM_ROM_ROM_EOT_Msk instead)  */
#define ARM_ROM_ROM_EOT_Msk                 0xFFFFFFFFu                                    /**< (ARM_ROM_ROM_EOT) Register Mask  */

/* -------- ARM_ROM_ROM_CSMT : (ARM_ROM Offset: 0xfcc) (R/ 8) System Memory accessible through DAP -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ROM_CSMT:1;                /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_ROM_ROM_CSMT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_CSMT_OFFSET             0xFCC                                         /**<  (ARM_ROM_ROM_CSMT) System Memory accessible through DAP  Offset */
#define ARM_ROM_ROM_CSMT_RESETVALUE         0x01u                                         /**<  (ARM_ROM_ROM_CSMT) System Memory accessible through DAP  Reset Value */

#define ARM_ROM_ROM_CSMT_ROM_CSMT_Pos       0                                              /**< (ARM_ROM_ROM_CSMT)  Position */
#define ARM_ROM_ROM_CSMT_ROM_CSMT_Msk       (0x1u << ARM_ROM_ROM_CSMT_ROM_CSMT_Pos)        /**< (ARM_ROM_ROM_CSMT)  Mask */
#define ARM_ROM_ROM_CSMT_ROM_CSMT           ARM_ROM_ROM_CSMT_ROM_CSMT_Msk                  /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_ROM_ROM_CSMT_ROM_CSMT_Msk instead */
#define ARM_ROM_ROM_CSMT_MASK               0x01u                                          /**< \deprecated (ARM_ROM_ROM_CSMT) Register MASK  (Use ARM_ROM_ROM_CSMT_Msk instead)  */
#define ARM_ROM_ROM_CSMT_Msk                0x01u                                          /**< (ARM_ROM_ROM_CSMT) Register Mask  */

/* -------- ARM_ROM_ROM_PID4 : (ARM_ROM Offset: 0xfd0) (R/ 8) Peripheral ID Register 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_C_CODE:4;           /**< bit:   0..3  JEP106 C Code                            */
    uint8_t  BLOCK_COUNT:4;             /**< bit:   4..7  Block Count                              */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_ROM_ROM_PID4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_PID4_OFFSET             0xFD0                                         /**<  (ARM_ROM_ROM_PID4) Peripheral ID Register 4  Offset */
#define ARM_ROM_ROM_PID4_RESETVALUE         0x04u                                         /**<  (ARM_ROM_ROM_PID4) Peripheral ID Register 4  Reset Value */

#define ARM_ROM_ROM_PID4_JEP106_C_CODE_Pos  0                                              /**< (ARM_ROM_ROM_PID4) JEP106 C Code Position */
#define ARM_ROM_ROM_PID4_JEP106_C_CODE_Msk  (0xFu << ARM_ROM_ROM_PID4_JEP106_C_CODE_Pos)   /**< (ARM_ROM_ROM_PID4) JEP106 C Code Mask */
#define ARM_ROM_ROM_PID4_JEP106_C_CODE(value) (ARM_ROM_ROM_PID4_JEP106_C_CODE_Msk & ((value) << ARM_ROM_ROM_PID4_JEP106_C_CODE_Pos))
#define ARM_ROM_ROM_PID4_BLOCK_COUNT_Pos    4                                              /**< (ARM_ROM_ROM_PID4) Block Count Position */
#define ARM_ROM_ROM_PID4_BLOCK_COUNT_Msk    (0xFu << ARM_ROM_ROM_PID4_BLOCK_COUNT_Pos)     /**< (ARM_ROM_ROM_PID4) Block Count Mask */
#define ARM_ROM_ROM_PID4_BLOCK_COUNT(value) (ARM_ROM_ROM_PID4_BLOCK_COUNT_Msk & ((value) << ARM_ROM_ROM_PID4_BLOCK_COUNT_Pos))
#define ARM_ROM_ROM_PID4_MASK               0xFFu                                          /**< \deprecated (ARM_ROM_ROM_PID4) Register MASK  (Use ARM_ROM_ROM_PID4_Msk instead)  */
#define ARM_ROM_ROM_PID4_Msk                0xFFu                                          /**< (ARM_ROM_ROM_PID4) Register Mask  */

/* -------- ARM_ROM_ROM_PID0 : (ARM_ROM Offset: 0xfe0) (R/ 8) Peripheral ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:8;             /**< bit:   0..7  Part Number Bits 7:0                     */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_ROM_ROM_PID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_PID0_OFFSET             0xFE0                                         /**<  (ARM_ROM_ROM_PID0) Peripheral ID Register 0  Offset */
#define ARM_ROM_ROM_PID0_RESETVALUE         0x71u                                         /**<  (ARM_ROM_ROM_PID0) Peripheral ID Register 0  Reset Value */

#define ARM_ROM_ROM_PID0_PART_NUMBER_Pos    0                                              /**< (ARM_ROM_ROM_PID0) Part Number Bits 7:0 Position */
#define ARM_ROM_ROM_PID0_PART_NUMBER_Msk    (0xFFu << ARM_ROM_ROM_PID0_PART_NUMBER_Pos)    /**< (ARM_ROM_ROM_PID0) Part Number Bits 7:0 Mask */
#define ARM_ROM_ROM_PID0_PART_NUMBER(value) (ARM_ROM_ROM_PID0_PART_NUMBER_Msk & ((value) << ARM_ROM_ROM_PID0_PART_NUMBER_Pos))
#define ARM_ROM_ROM_PID0_MASK               0xFFu                                          /**< \deprecated (ARM_ROM_ROM_PID0) Register MASK  (Use ARM_ROM_ROM_PID0_Msk instead)  */
#define ARM_ROM_ROM_PID0_Msk                0xFFu                                          /**< (ARM_ROM_ROM_PID0) Register Mask  */

/* -------- ARM_ROM_ROM_PID1 : (ARM_ROM Offset: 0xfe4) (R/ 8) Peripheral ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:4;             /**< bit:   0..3  Part Number Bits 11:8                    */
    uint8_t  JEP106_ID_3_0:4;           /**< bit:   4..7  JEP106 ID Code Bits 6:4                  */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_ROM_ROM_PID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_PID1_OFFSET             0xFE4                                         /**<  (ARM_ROM_ROM_PID1) Peripheral ID Register 1  Offset */
#define ARM_ROM_ROM_PID1_RESETVALUE         0xB4u                                         /**<  (ARM_ROM_ROM_PID1) Peripheral ID Register 1  Reset Value */

#define ARM_ROM_ROM_PID1_PART_NUMBER_Pos    0                                              /**< (ARM_ROM_ROM_PID1) Part Number Bits 11:8 Position */
#define ARM_ROM_ROM_PID1_PART_NUMBER_Msk    (0xFu << ARM_ROM_ROM_PID1_PART_NUMBER_Pos)     /**< (ARM_ROM_ROM_PID1) Part Number Bits 11:8 Mask */
#define ARM_ROM_ROM_PID1_PART_NUMBER(value) (ARM_ROM_ROM_PID1_PART_NUMBER_Msk & ((value) << ARM_ROM_ROM_PID1_PART_NUMBER_Pos))
#define ARM_ROM_ROM_PID1_JEP106_ID_3_0_Pos  4                                              /**< (ARM_ROM_ROM_PID1) JEP106 ID Code Bits 6:4 Position */
#define ARM_ROM_ROM_PID1_JEP106_ID_3_0_Msk  (0xFu << ARM_ROM_ROM_PID1_JEP106_ID_3_0_Pos)   /**< (ARM_ROM_ROM_PID1) JEP106 ID Code Bits 6:4 Mask */
#define ARM_ROM_ROM_PID1_JEP106_ID_3_0(value) (ARM_ROM_ROM_PID1_JEP106_ID_3_0_Msk & ((value) << ARM_ROM_ROM_PID1_JEP106_ID_3_0_Pos))
#define ARM_ROM_ROM_PID1_MASK               0xFFu                                          /**< \deprecated (ARM_ROM_ROM_PID1) Register MASK  (Use ARM_ROM_ROM_PID1_Msk instead)  */
#define ARM_ROM_ROM_PID1_Msk                0xFFu                                          /**< (ARM_ROM_ROM_PID1) Register Mask  */

/* -------- ARM_ROM_ROM_PID2 : (ARM_ROM Offset: 0xfe8) (R/ 8) Peripheral ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_ID_6_4:3;           /**< bit:   0..2  JEP106 ID Code Bits 6:4                  */
    uint8_t  JEDEC_USED:1;              /**< bit:      3  JEDEC Used                               */
    uint8_t  REVISION:4;                /**< bit:   4..7  Revision                                 */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_ROM_ROM_PID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_PID2_OFFSET             0xFE8                                         /**<  (ARM_ROM_ROM_PID2) Peripheral ID Register 2  Offset */
#define ARM_ROM_ROM_PID2_RESETVALUE         0x0Bu                                         /**<  (ARM_ROM_ROM_PID2) Peripheral ID Register 2  Reset Value */

