remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_rom.h
#define ARM_ROM_ROM_PID2_JEP106_ID_6_4_Pos  0                                              /**< (ARM_ROM_ROM_PID2) JEP106 ID Code Bits 6:4 Position */
#define ARM_ROM_ROM_PID2_JEP106_ID_6_4_Msk  (0x7u << ARM_ROM_ROM_PID2_JEP106_ID_6_4_Pos)   /**< (ARM_ROM_ROM_PID2) JEP106 ID Code Bits 6:4 Mask */
#define ARM_ROM_ROM_PID2_JEP106_ID_6_4(value) (ARM_ROM_ROM_PID2_JEP106_ID_6_4_Msk & ((value) << ARM_ROM_ROM_PID2_JEP106_ID_6_4_Pos))
#define ARM_ROM_ROM_PID2_JEDEC_USED_Pos     3                                              /**< (ARM_ROM_ROM_PID2) JEDEC Used Position */
#define ARM_ROM_ROM_PID2_JEDEC_USED_Msk     (0x1u << ARM_ROM_ROM_PID2_JEDEC_USED_Pos)      /**< (ARM_ROM_ROM_PID2) JEDEC Used Mask */
#define ARM_ROM_ROM_PID2_JEDEC_USED         ARM_ROM_ROM_PID2_JEDEC_USED_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_ROM_ROM_PID2_JEDEC_USED_Msk instead */
#define ARM_ROM_ROM_PID2_REVISION_Pos       4                                              /**< (ARM_ROM_ROM_PID2) Revision Position */
#define ARM_ROM_ROM_PID2_REVISION_Msk       (0xFu << ARM_ROM_ROM_PID2_REVISION_Pos)        /**< (ARM_ROM_ROM_PID2) Revision Mask */
#define ARM_ROM_ROM_PID2_REVISION(value)    (ARM_ROM_ROM_PID2_REVISION_Msk & ((value) << ARM_ROM_ROM_PID2_REVISION_Pos))
#define ARM_ROM_ROM_PID2_MASK               0xFFu                                          /**< \deprecated (ARM_ROM_ROM_PID2) Register MASK  (Use ARM_ROM_ROM_PID2_Msk instead)  */
#define ARM_ROM_ROM_PID2_Msk                0xFFu                                          /**< (ARM_ROM_ROM_PID2) Register Mask  */

/* -------- ARM_ROM_ROM_PID3 : (ARM_ROM Offset: 0xfec) (R/ 8) Peripheral ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CUSTOMER_MOD_NUMBER:4;     /**< bit:   0..3  Customer Modification Number             */
    uint8_t  ECO_REV_NUMBER:4;          /**< bit:   4..7  ECO Revision Number                      */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_ROM_ROM_PID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_PID3_OFFSET             0xFEC                                         /**<  (ARM_ROM_ROM_PID3) Peripheral ID Register 3  Offset */
#define ARM_ROM_ROM_PID3_RESETVALUE         0x00u                                         /**<  (ARM_ROM_ROM_PID3) Peripheral ID Register 3  Reset Value */

#define ARM_ROM_ROM_PID3_CUSTOMER_MOD_NUMBER_Pos 0                                              /**< (ARM_ROM_ROM_PID3) Customer Modification Number Position */
#define ARM_ROM_ROM_PID3_CUSTOMER_MOD_NUMBER_Msk (0xFu << ARM_ROM_ROM_PID3_CUSTOMER_MOD_NUMBER_Pos)  /**< (ARM_ROM_ROM_PID3) Customer Modification Number Mask */
#define ARM_ROM_ROM_PID3_CUSTOMER_MOD_NUMBER(value) (ARM_ROM_ROM_PID3_CUSTOMER_MOD_NUMBER_Msk & ((value) << ARM_ROM_ROM_PID3_CUSTOMER_MOD_NUMBER_Pos))
#define ARM_ROM_ROM_PID3_ECO_REV_NUMBER_Pos 4                                              /**< (ARM_ROM_ROM_PID3) ECO Revision Number Position */
#define ARM_ROM_ROM_PID3_ECO_REV_NUMBER_Msk (0xFu << ARM_ROM_ROM_PID3_ECO_REV_NUMBER_Pos)  /**< (ARM_ROM_ROM_PID3) ECO Revision Number Mask */
#define ARM_ROM_ROM_PID3_ECO_REV_NUMBER(value) (ARM_ROM_ROM_PID3_ECO_REV_NUMBER_Msk & ((value) << ARM_ROM_ROM_PID3_ECO_REV_NUMBER_Pos))
#define ARM_ROM_ROM_PID3_MASK               0xFFu                                          /**< \deprecated (ARM_ROM_ROM_PID3) Register MASK  (Use ARM_ROM_ROM_PID3_Msk instead)  */
#define ARM_ROM_ROM_PID3_Msk                0xFFu                                          /**< (ARM_ROM_ROM_PID3) Register Mask  */

/* -------- ARM_ROM_ROM_CID0 : (ARM_ROM Offset: 0xff0) (R/ 8) Component ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ROM_CID0:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_ROM_ROM_CID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_CID0_OFFSET             0xFF0                                         /**<  (ARM_ROM_ROM_CID0) Component ID Register 0  Offset */
#define ARM_ROM_ROM_CID0_RESETVALUE         0x0Du                                         /**<  (ARM_ROM_ROM_CID0) Component ID Register 0  Reset Value */

#define ARM_ROM_ROM_CID0_ROM_CID0_Pos       0                                              /**< (ARM_ROM_ROM_CID0)  Position */
#define ARM_ROM_ROM_CID0_ROM_CID0_Msk       (0xFFu << ARM_ROM_ROM_CID0_ROM_CID0_Pos)       /**< (ARM_ROM_ROM_CID0)  Mask */
#define ARM_ROM_ROM_CID0_ROM_CID0(value)    (ARM_ROM_ROM_CID0_ROM_CID0_Msk & ((value) << ARM_ROM_ROM_CID0_ROM_CID0_Pos))
#define ARM_ROM_ROM_CID0_MASK               0xFFu                                          /**< \deprecated (ARM_ROM_ROM_CID0) Register MASK  (Use ARM_ROM_ROM_CID0_Msk instead)  */
#define ARM_ROM_ROM_CID0_Msk                0xFFu                                          /**< (ARM_ROM_ROM_CID0) Register Mask  */

/* -------- ARM_ROM_ROM_CID1 : (ARM_ROM Offset: 0xff4) (R/ 8) Component ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ROM_CID1:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_ROM_ROM_CID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_CID1_OFFSET             0xFF4                                         /**<  (ARM_ROM_ROM_CID1) Component ID Register 1  Offset */
#define ARM_ROM_ROM_CID1_RESETVALUE         0x10u                                         /**<  (ARM_ROM_ROM_CID1) Component ID Register 1  Reset Value */

#define ARM_ROM_ROM_CID1_ROM_CID1_Pos       0                                              /**< (ARM_ROM_ROM_CID1)  Position */
#define ARM_ROM_ROM_CID1_ROM_CID1_Msk       (0xFFu << ARM_ROM_ROM_CID1_ROM_CID1_Pos)       /**< (ARM_ROM_ROM_CID1)  Mask */
#define ARM_ROM_ROM_CID1_ROM_CID1(value)    (ARM_ROM_ROM_CID1_ROM_CID1_Msk & ((value) << ARM_ROM_ROM_CID1_ROM_CID1_Pos))
#define ARM_ROM_ROM_CID1_MASK               0xFFu                                          /**< \deprecated (ARM_ROM_ROM_CID1) Register MASK  (Use ARM_ROM_ROM_CID1_Msk instead)  */
#define ARM_ROM_ROM_CID1_Msk                0xFFu                                          /**< (ARM_ROM_ROM_CID1) Register Mask  */

/* -------- ARM_ROM_ROM_CID2 : (ARM_ROM Offset: 0xff8) (R/ 8) Component ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ROM_CID2:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_ROM_ROM_CID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_CID2_OFFSET             0xFF8                                         /**<  (ARM_ROM_ROM_CID2) Component ID Register 2  Offset */
#define ARM_ROM_ROM_CID2_RESETVALUE         0x05u                                         /**<  (ARM_ROM_ROM_CID2) Component ID Register 2  Reset Value */

#define ARM_ROM_ROM_CID2_ROM_CID2_Pos       0                                              /**< (ARM_ROM_ROM_CID2)  Position */
#define ARM_ROM_ROM_CID2_ROM_CID2_Msk       (0xFFu << ARM_ROM_ROM_CID2_ROM_CID2_Pos)       /**< (ARM_ROM_ROM_CID2)  Mask */
#define ARM_ROM_ROM_CID2_ROM_CID2(value)    (ARM_ROM_ROM_CID2_ROM_CID2_Msk & ((value) << ARM_ROM_ROM_CID2_ROM_CID2_Pos))
#define ARM_ROM_ROM_CID2_MASK               0xFFu                                          /**< \deprecated (ARM_ROM_ROM_CID2) Register MASK  (Use ARM_ROM_ROM_CID2_Msk instead)  */
#define ARM_ROM_ROM_CID2_Msk                0xFFu                                          /**< (ARM_ROM_ROM_CID2) Register Mask  */

/* -------- ARM_ROM_ROM_CID3 : (ARM_ROM Offset: 0xffc) (R/ 8) Component ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ROM_CID3:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_ROM_ROM_CID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_ROM_ROM_CID3_OFFSET             0xFFC                                         /**<  (ARM_ROM_ROM_CID3) Component ID Register 3  Offset */
#define ARM_ROM_ROM_CID3_RESETVALUE         0xB1u                                         /**<  (ARM_ROM_ROM_CID3) Component ID Register 3  Reset Value */

#define ARM_ROM_ROM_CID3_ROM_CID3_Pos       0                                              /**< (ARM_ROM_ROM_CID3)  Position */
#define ARM_ROM_ROM_CID3_ROM_CID3_Msk       (0xFFu << ARM_ROM_ROM_CID3_ROM_CID3_Pos)       /**< (ARM_ROM_ROM_CID3)  Mask */
#define ARM_ROM_ROM_CID3_ROM_CID3(value)    (ARM_ROM_ROM_CID3_ROM_CID3_Msk & ((value) << ARM_ROM_ROM_CID3_ROM_CID3_Pos))
#define ARM_ROM_ROM_CID3_MASK               0xFFu                                          /**< \deprecated (ARM_ROM_ROM_CID3) Register MASK  (Use ARM_ROM_ROM_CID3_Msk instead)  */
#define ARM_ROM_ROM_CID3_Msk                0xFFu                                          /**< (ARM_ROM_ROM_CID3) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief ARM_ROM hardware registers */
typedef struct {  /* ARM ROM */
  RoReg   ROM_SCS;        /**< (ARM_ROM Offset: 0x00) Points to the SCS at 0xE000E000 */
  __I  uint32_t Reserved1[3];
  RoReg   ROM_DWT;        /**< (ARM_ROM Offset: 0x10) Points to the DWT at 0xE0001000 */
  __I  uint32_t Reserved2[3];
  RoReg   ROM_BPU;        /**< (ARM_ROM Offset: 0x20) Points to the BPU at 0xE0002000 */
  __I  uint32_t Reserved3[3];
  RoReg   ROM_EOT;        /**< (ARM_ROM Offset: 0x30) End of Table Marker */
  __I  uint32_t Reserved4[998];
  RoReg8  ROM_CSMT;       /**< (ARM_ROM Offset: 0xFCC) System Memory accessible through DAP */
  __I  uint8_t  Reserved5[3];
  RoReg8  ROM_PID4;       /**< (ARM_ROM Offset: 0xFD0) Peripheral ID Register 4 */
  __I  uint8_t  Reserved6[15];
  RoReg8  ROM_PID0;       /**< (ARM_ROM Offset: 0xFE0) Peripheral ID Register 0 */
  __I  uint8_t  Reserved7[3];
  RoReg8  ROM_PID1;       /**< (ARM_ROM Offset: 0xFE4) Peripheral ID Register 1 */
  __I  uint8_t  Reserved8[3];
  RoReg8  ROM_PID2;       /**< (ARM_ROM Offset: 0xFE8) Peripheral ID Register 2 */
  __I  uint8_t  Reserved9[3];
  RoReg8  ROM_PID3;       /**< (ARM_ROM Offset: 0xFEC) Peripheral ID Register 3 */
  __I  uint8_t  Reserved10[3];
  RoReg8  ROM_CID0;       /**< (ARM_ROM Offset: 0xFF0) Component ID Register 0 */
  __I  uint8_t  Reserved11[3];
  RoReg8  ROM_CID1;       /**< (ARM_ROM Offset: 0xFF4) Component ID Register 1 */
  __I  uint8_t  Reserved12[3];
  RoReg8  ROM_CID2;       /**< (ARM_ROM Offset: 0xFF8) Component ID Register 2 */
  __I  uint8_t  Reserved13[3];
  RoReg8  ROM_CID3;       /**< (ARM_ROM Offset: 0xFFC) Component ID Register 3 */
} ArmRom;

