remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_rom.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief ARM_ROM hardware registers */
typedef struct {  /* ARM ROM */
  __I  ARM_ROM_ROM_SCS_Type           ROM_SCS;        /**< Offset: 0x00 (R/   32) Points to the SCS at 0xE000E000 */
       RoReg8                         Reserved1[0xC];
  __I  ARM_ROM_ROM_DWT_Type           ROM_DWT;        /**< Offset: 0x10 (R/   32) Points to the DWT at 0xE0001000 */
       RoReg8                         Reserved2[0xC];
  __I  ARM_ROM_ROM_BPU_Type           ROM_BPU;        /**< Offset: 0x20 (R/   32) Points to the BPU at 0xE0002000 */
       RoReg8                         Reserved3[0xC];
  __I  ARM_ROM_ROM_EOT_Type           ROM_EOT;        /**< Offset: 0x30 (R/   32) End of Table Marker */
       RoReg8                         Reserved4[0xF98];
  __I  ARM_ROM_ROM_CSMT_Type          ROM_CSMT;       /**< Offset: 0xFCC (R/    8) System Memory accessible through DAP */
       RoReg8                         Reserved5[0x3];
  __I  ARM_ROM_ROM_PID4_Type          ROM_PID4;       /**< Offset: 0xFD0 (R/    8) Peripheral ID Register 4 */
       RoReg8                         Reserved6[0xF];
  __I  ARM_ROM_ROM_PID0_Type          ROM_PID0;       /**< Offset: 0xFE0 (R/    8) Peripheral ID Register 0 */
       RoReg8                         Reserved7[0x3];
  __I  ARM_ROM_ROM_PID1_Type          ROM_PID1;       /**< Offset: 0xFE4 (R/    8) Peripheral ID Register 1 */
       RoReg8                         Reserved8[0x3];
  __I  ARM_ROM_ROM_PID2_Type          ROM_PID2;       /**< Offset: 0xFE8 (R/    8) Peripheral ID Register 2 */
       RoReg8                         Reserved9[0x3];
  __I  ARM_ROM_ROM_PID3_Type          ROM_PID3;       /**< Offset: 0xFEC (R/    8) Peripheral ID Register 3 */
       RoReg8                         Reserved10[0x3];
  __I  ARM_ROM_ROM_CID0_Type          ROM_CID0;       /**< Offset: 0xFF0 (R/    8) Component ID Register 0 */
       RoReg8                         Reserved11[0x3];
  __I  ARM_ROM_ROM_CID1_Type          ROM_CID1;       /**< Offset: 0xFF4 (R/    8) Component ID Register 1 */
       RoReg8                         Reserved12[0x3];
  __I  ARM_ROM_ROM_CID2_Type          ROM_CID2;       /**< Offset: 0xFF8 (R/    8) Component ID Register 2 */
       RoReg8                         Reserved13[0x3];
  __I  ARM_ROM_ROM_CID3_Type          ROM_CID3;       /**< Offset: 0xFFC (R/    8) Component ID Register 3 */
} ArmRom;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_ARM_ROM_COMPONENT_ */
